app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "a;nckajlsdnljsf alskjdlkasduabusd"], ["updated_at", 2017-03-14 16:10:30 UTC], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    if (@post.update(post_params))

SELECT "posts".* FROM "posts"
---
  def list
    @posts = Post.all

INSERT INTO "posts" ("title", "headline", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    #render plain: params[:post].inspect
    @post = Post.new(post_params)
    if (@post.save)